In [15]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
pd.read_csv('../data/gdp_percapita.csv')

,Country or Area,Year,Value,Value Footnotes
0,Afghanistan,2019,2065.036398,NaN
1,Afghanistan,2018,2033.779002,NaN
2,Afghanistan,2017,2058.383832,NaN
3,Afghanistan,2016,2057.062164,NaN
4,Afghanistan,2015,2068.265904,NaN
...,...,...,...,...
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [18]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')

In [19]:
gdp_df

,Country or Area,Year,Value,Value Footnotes
0,Afghanistan,2019,2065.036398,NaN
1,Afghanistan,2018,2033.779002,NaN
2,Afghanistan,2017,2058.383832,NaN
3,Afghanistan,2016,2057.062164,NaN
4,Afghanistan,2015,2068.265904,NaN
...,...,...,...,...
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [20]:
#drop one column by name
df.drop('Country or Area', axis=6868, inplace=True)

NameError: name 'df' is not defined

In [26]:
print (gdp_df.head())

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN

In [28]:
data_clean = gdp_df.dropna()

In [30]:
print(data_clean.head())

     Country or Area  Year        Value  Value Footnotes
5952           Sudan  2011  3654.211734              2.0

In [31]:
data_clean.head()

     Country or Area  Year        Value  Value Footnotes
5952           Sudan  2011  3654.211734              2.0

In [34]:
df1 = pd.read_csv('../data/gdp_percapita.csv')
print("The dataframe before modification is:")
print(df1)
new_df = df1.rename(columns={'Country or Area': "Country"})
print("The dataframe after modification is:")
print(new_df)

The dataframe before modification is:
     Country or Area                                      Year        Value  \
0        Afghanistan                                      2019  2065.036398
1        Afghanistan                                      2018  2033.779002
2        Afghanistan                                      2017  2058.383832
3        Afghanistan                                      2016  2057.062164
4        Afghanistan                                      2015  2068.265904
...              ...                                       ...          ...
6865        Zimbabwe                                      1992  3054.889178
6866        Zimbabwe                                      1991  3426.598094
6867        Zimbabwe                                      1990  3324.348171
6868   footnoteSeqID                                  Footnote          NaN
6869               2  Excludes South Sudan after July 9, 2011.          NaN

      Value Footnotes
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
6865              NaN
6866              NaN
6867              NaN
6868              NaN
6869              NaN

[6870 rows x 4 columns]
The dataframe after modification is:
            Country                                      Year        Value  \
0       Afghanistan                                      2019  2065.036398
1       Afghanistan                                      2018  2033.779002
2       Afghanistan                                      2017  2058.383832
3       Afghanistan                                      2016  2057.062164
4       Afghanistan                                      2015  2068.265904
...             ...                                       ...          ...
6865       Zimbabwe                                      1992  3054.889178
6866       Zimbabwe                                      1991  3426.598094
6867       Zimbabwe                                      1990  3324.348171
6868  footnoteSeqID                                  Footnote          NaN
6869              2  Excludes South Sudan after July 9, 2011.          NaN

      Value Footnotes
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
6865              NaN
6866              NaN
6867              NaN
6868              NaN
6869              NaN

[6870 rows x 4 columns]

In [36]:
df1 = pd.read_csv('../data/gdp_percapita.csv')
print("The dataframe before modification is:")
print(df1)
new_df = df1.rename(columns={'Value': "GDP_Per_Capita"})
print("The dataframe after modification is:")
print(new_df)

The dataframe before modification is:
     Country or Area                                      Year        Value  \
0        Afghanistan                                      2019  2065.036398
1        Afghanistan                                      2018  2033.779002
2        Afghanistan                                      2017  2058.383832
3        Afghanistan                                      2016  2057.062164
4        Afghanistan                                      2015  2068.265904
...              ...                                       ...          ...
6865        Zimbabwe                                      1992  3054.889178
6866        Zimbabwe                                      1991  3426.598094
6867        Zimbabwe                                      1990  3324.348171
6868   footnoteSeqID                                  Footnote          NaN
6869               2  Excludes South Sudan after July 9, 2011.          NaN

      Value Footnotes
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
6865              NaN
6866              NaN
6867              NaN
6868              NaN
6869              NaN

[6870 rows x 4 columns]
The dataframe after modification is:
     Country or Area                                      Year  \
0        Afghanistan                                      2019
1        Afghanistan                                      2018
2        Afghanistan                                      2017
3        Afghanistan                                      2016
4        Afghanistan                                      2015
...              ...                                       ...
6865        Zimbabwe                                      1992
6866        Zimbabwe                                      1991
6867        Zimbabwe                                      1990
6868   footnoteSeqID                                  Footnote
6869               2  Excludes South Sudan after July 9, 2011.

      GDP_Per_Capita  Value Footnotes
0        2065.036398              NaN
1        2033.779002              NaN
2        2058.383832              NaN
3        2057.062164              NaN
4        2068.265904              NaN
...              ...              ...
6865     3054.889178              NaN
6866     3426.598094              NaN
6867     3324.348171              NaN
6868             NaN              NaN
6869             NaN              NaN

[6870 rows x 4 columns]

In [38]:
df1=df1.drop(['Value Footnotes'], axis=1)

In [41]:
print(df1)

     Country or Area                                      Year        Value
0        Afghanistan                                      2019  2065.036398
1        Afghanistan                                      2018  2033.779002
2        Afghanistan                                      2017  2058.383832
3        Afghanistan                                      2016  2057.062164
4        Afghanistan                                      2015  2068.265904
...              ...                                       ...          ...
6865        Zimbabwe                                      1992  3054.889178
6866        Zimbabwe                                      1991  3426.598094
6867        Zimbabwe                                      1990  3324.348171
6868   footnoteSeqID                                  Footnote          NaN
6869               2  Excludes South Sudan after July 9, 2011.          NaN

[6870 rows x 3 columns]

df1

In [8]:
gdp_df = gdp_df.astype({'Country': "category"})

NameError: name 'gdp_df' is not defined